# 情報はアマゾンより引用（0.5.23）

# heroku用のシード（画像なし）
Game.create(title: "モンスターハンターワールド-アイスボーン", company: "CAPCOM", price: 5345, genre: 1, released_at: "2019/9/6",
            story: "さらに解き放て、狩猟本能
            『モンスターハンター：ワールド』のエンディング後から始まる、さらなる狩りの世界が幕を開ける。
            新たな任務。前人未踏の地を調査せよ。
            モンスターたちに起こる異変。その追跡調査によって新たな物語が幕をあける。
            古代樹の森から群を成して飛び去るレイギエナが目撃される。
            そのただならぬ気配に追跡調査を決めた調査団は3期団の気球に乗りこみ、海を渡った。
            波濤の先に姿を現したのは雪と氷に閉ざされた世界と、そこに息づく生態系だった。
            調査団の新たな任務は≪渡りの凍て地≫と呼ばれる寒冷地の調査。
            新たに発見された地域で前人未踏の地と考えられており、
            まだ見ぬ環境生物やモンスターの生態を調べることが大きな目的の一つとなる。")
Game.create(title: "Red Dead Redemption 2", company: "Rockstar Games", price: 4080, genre: 1, released_at: "2018/10/26",
            story: "『グランド・セフト・オートV』と『レッド・デッド・リデンプション』のクリエイター陣がお届けする『レッド・デッド・リデンプション2』では、幕が上がったばかりの現代アメリカで、壮大な物語が描かれます。
            ストーリー
            1899年、アメリカ。開拓時代が終わり、法執行官は無法者のギャングを一掃し始めた。降伏や屈服しない者たちは、次々にその命を奪われていった。 西部の町、ブラックウォーターで大掛かりな強盗に失敗した後、アーサー・モーガンとダッチギャングは逃亡を余儀なくされる。 連邦捜査官と国中の賞金稼ぎに追われる中、ギャングが生き延びるためにはアメリカの荒れた土地で強奪、暴力、盗みを働くしかない。 抗争に関わるほど、ギャングはバラバラにされる危機に見舞われる。アーサーは自らの理想と、自分を育ててくれたギャングへの忠誠、そのどちらかの選択を迫られる。") 
Game.create(title: "Marvel's Spider-Man", company: "ソニー・インタラクティブエンタテインメント", price: 4473, genre: 1, released_at: "2018/9/7",
            story: "『Marvel's Spider-Man』は、超人気スーパーヒーロー、スパイダーマンとなり、広大な都市を縦横無尽に駆け巡りながら犯罪と戦うオープンワールドアクション大作です。
            本作は、ソニー・インタラクティブエンタテインメントとマーベル、そしてインソムニアック・ゲームズが一体となって作りあげた最強のスパイダーマン・アクションです。 PS4 (R) ならではのクオリティで再現された広大なニューヨークの街を、映画やコミックスでもおなじみのウェブ・スイングによって高速移動していく、唯一無二の爽快感を味わうことが出来ます。
            さらに本作では、街中にあるものを利用して戦ったり、スパイダーマンらしいトリッキーな動きや必殺アクションを素早く使い分けたりと、多彩な戦闘アクションが用意されています。
            プレイヤーは新聞社に勤める青年ピーター・パーカー (スパイダーマン) となり、ニューヨークの街中をかけめぐり、ヴィラン (様々なスーパーパワーをもった凶悪犯) たちによる犯罪を解決していきます。スパイダーマンとしての能力を得てから8年、何百万の人々を守るために正体を隠しながら戦うピーターの、ヒロイックで爽快なストーリーにも注目です。
            『Marvel's Spider-Man デジタルデラックス版』は、ゲーム本編と追加ストーリーDLC 3部作「摩天楼は眠らない」がセットになっています。このDLCでは、新しいミッション、キャラクター、ヴィラン、スパイディ・スーツが登場し、新たなストーリーを楽しむことができます (*DLCは2019年3月までに配信予定です) ")
Game.create(title: "Watch Dogs 2", company: "UBIsoft", price: 4990, genre: 1, released_at: "2016/12/1",
            story: "ハッカーの世界へようこそ。
            2016年、アメリカの数都市で街の安全性と効率性を高めるために都市インフラをネットワークで繋ぐ、最先端のオペレーティングシステムctOS 2.0 が導入された。
            技術革新発祥の地、サンフランシスコ・ベイエリアに暮らす頭脳明晰な若きハッカー、マーカス・ホロウェイは、有名ハッカーグループ、デッドセックの仲間と共に、腐敗した企業の手によって、
            不正に大規模な市民の監視と操作を行うctOS 2.0 の隠された危険を暴いていく。
            マーカスとデッドセックは、ハッキングの能力を駆使してctOS 2.0 をシャットダウンさせられるのだろうか。
            市民の手に自由を取り戻す戦いが、今始まる")
Game.create(title: "Horizon Zero Dawn", company: "ソニー", price: 1773, genre: 1, released_at: "2019/6/27",
            story: "『Horizon Zero Dawn』に拡張コンテンツ「凍てついた大地」を加えた待望の完全版がお求めやすい価格で再登場！
            ■生命に満ちた、終末後の世界
            どのようにして機械が世界を支配することとなったのか？機械たちが求めるものは？かつて存在した文明に一体何が起きたのか？古の遺物や謎に満ちた建造物が点在する世界をくまなく探索し、忘れ去られた大地の秘密や歴史を解き明かそう。
            ■大自然と機械　相反する存在
            美しい自然と生命に溢れる世界と、息をのむような先端技術という二つの相反する要素が存在する。この二つの要素が合わさることで、ゲームプレイと探索要素がよりダイナミックなものとなっている。
            ■圧倒的に不利な状況に立ち向かえ
            本作の戦闘は、スピードと知恵を有するアーロイと、圧倒的な力とサイズを有する機械の対立がベースとなっている。大きさはもちろん、技術的にも優れた敵を相手に、アーロイは持ちうる知恵と知識、そして力の全てをぶつけ、生き残らなくてはならない。")
Game.create(title: "Grand Theft Auto V", company: "Rockstar Games", price: 3535, genre: 1, released_at: "2019/11/7",
            story: "ストリートで非合法な仕事をする若者、足を洗った銀行強盗、そして凶暴で反社会的な3人の男が、問題事に巻き込まれていく。 そんな中、互いはもとより誰も信用できない非情な街で生き残るため、危険な一連の強盗に挑む")
Game.create(title: "DEATH STRANDING", company: "ソニー", price: 5277, genre: 1, released_at: "2019/11/8",
            story: "Tomorrow Is In Your Hands.
            全世界待望。小島秀夫がPlayStaion4で創造する、未だかつてないゲーム体験。
            「デス・ストランディング」の発生によって、人々や都市は引き裂かれ、分断された。 繋がりを失った人類は滅亡の危機にさらされていた。サム・ポーター・ブリッジズは、孤立し動くことができなくなった人々のために “未来”を運ぶ任務に赴く。 「デス・ストランディング」とは何なのか。サムは何を運び、何を繋げるのか。予想を凌駕するゲーム体験の先に、衝撃の展開が待ち受ける。
            主人公サム・ブリッジスを演じるノーマン・リーダスをはじめ、マッツ・ミケルセン、レア・セドゥ、リンゼイ・ワグナーら世界的名優たちが出演。")
Game.create(title: "METAL GEAR SOLID V- GROUND ZEROES + THE PHANTOM PAIN", company: "KONAMI", price: 3564, genre: 1, released_at: "2016/11/10",
            story: "メタルギアソリッドVの2作品が入った決定版!
            収録内容「METAL GEAR SOLID V: GROUND ZEROES」「METAL GEAR SOLID V: THE PHANTOM PAIN 」")
Game.create(title: "ニーア オートマタ", company: "スクエア・エニックス", price: 4182, genre: 1, released_at: "2019/2/21",
            story: "『NieR:Automata』について
            これは呪いか。それとも罰か。
            『NieR:Automata』は、スクウェア・エニックスがプロデュース、プラチナゲームズが開発を手掛けるアクションRPGです。
            舞台は、宇宙人が繰り出す「機械生命体」の圧倒的戦力を前に、人類が月へと敗走している遥か未来。プレイヤーは、新たに組織されたアンドロイド部隊「ヨルハ」所属の「2B」となり、地球奪還のための熾烈な戦いに身を投じることになります。
            単なるエンターテインメント作品にとどまらない、さまざまな感情をかき立てる物語を、滑らかな60fpsのオープンワールドで体験いただけます。")
Game.create(title: "Ghost of Tsushima", company: "ソニー", price: 6078, genre: 1, released_at: "2020/7/17",
            story: "武士の道から外れ、邪道に落ちた兵「冥人(くろうど)」となれ
            文永(十三世紀後半)、モンゴル帝国(大元)は東方世界の征服をもくろみ、立ちふさがるすべての国を蹂躙していた。
            東の果て、日本に侵攻すべく編成された元軍の大船団を率いるのは、冷酷にして狡猾な智将、コトゥン・ハーン。ハーンは、侵攻の足掛かりとして対馬に上陸する。
            これを防ぐべく集結した対馬の武士団は、初めて見る元軍の兵略によって初戦で壊滅。島はたちまち侵略の炎に包まれる。
            だが、かろうじて生き延びた一人の武士がいた。
            境井 仁(さかい じん)。
            仁は、境井家の最後の生き残りとして、たとえ侍の道に反した戦い方に手を染めることになっても対馬の民を守ろうと決意する。冥府から蘇った者「冥人(くろうど)」として、あらゆる手段を使って故郷を敵の手から取り戻すのだ。")
Game.create(title: "Assassin's Creed the Ezio collection", company: "UBIsoft", price: 5009, genre: 2, released_at: "2017/2/23",
            story: "【アサシン クリード II】 美術、富、そして謀略の時代であるルネサンス期のイタリア。陰謀により家族を失ったエツィオは、復讐のためアサシンとなる道を選ぶ。 ※シングルプレイヤーミッションと、追加ミッション「シークエンス12 フォルリの戦い」、「シークエンス13 虚栄のかがり火」を収録。
            【アサシン クリード ブラザーフッド】 暴政を振るうボルジア家。その手からローマを開放するため、「マスターアサシン」となったエツィオは、アサシンギルドを組織して立ち上がる。※シングルプレイヤーミッションと追加ミッション「ダ・ヴィンチ、失踪」、「コペルニクスミッション」を収録。
            【アサシン クリード リベレーション】 オスマン帝国の中心である16世紀コンスタンティノープル。今や熟年の域に達したエツィオは、伝説のアサシン「アルタイル」の足跡を追い、この地に潜入する。※シングルプレイヤーミッションと、追加ミッション「失われた記憶」を収録。")
Game.create(title: "Assassin's Creed 4 Black Flag", company: "UBIsoft", price: 9370, genre: 2, released_at: "2014/2/22",
            story: "暗殺者 × 海賊
            人気シリーズ最新作！今度の主役は若き海賊！
            「アサシン クリード」シリーズのナンバリングタイトル第４弾の舞台は、１８世紀の西インド諸島（現在のカリブ）
            時代設定は、カリブ海で海賊たちが暴れまわっていた”海賊黄金時代”の末期と言われる１７１５年からの１０年間。
            死と隣合せのカリブ海で、「海賊」であり「暗殺者」でもあるエドワードが冒険を繰り広げる。")
Game.create(title: "Assassin's Creed Unity", company: "UBIsoft", price: 5100, genre: 2, released_at: "2014/11/20",
            story: "1789年、パリ。フランス革命の勃発により、花の都は恐怖と混沌に支配されていた。石畳は王侯貴族の圧政に対して立ち上がった民衆の血によって赤く染まった。古き国家体制の崩れゆく中、革命の背後に潜む真実を暴く為、アルノは立ち上がる。そして国家の運命を巡る激烈な戦い中で、彼は大いなるアサシンの力に目覚めていく。「アサシン クリード　ユニティ」は、次世代機用に新規開発された新アンヴィルエンジンと共に、シリーズの新たなチャプターへと突入。バスティーユ監獄の襲撃、ルイ16世の処刑など、フランス革命の様々なシーンが再現されており、ゲームプレイを通して、プレイヤーはヨーロッパの歴史の大きなターニングポイントであるフランス革命に参加することができる。")
Game.create(title: "Witcher 3 Wild Hunt", company: "スパイク・チュンソフト", price: 6680, genre: 2, released_at: "2016/9/1",
            story: "発売前に160以上のメディアアワードを獲得した、全世界待望のオープンワールド・アクションロールプレイングゲーム。
            変化するノンリニアストーリー:プレイヤーの選択により物語はさまざまに分岐し、プレイヤーの行動が世界に影響を与え、メインストーリーも変化していく。
            境界なく広がるオープンワールド:馬に乗って大草原を駆けたり、船を操り航海に出たり、前作の約35倍の広さとなる広大なマップを、シームレスに探索可能。
            ダイナミックで戦略的なアクションバトル:本作の戦闘システムは、リアルタイムかつアクション重視。プレイヤーは単に剣を振るうだけでなく、罠を使ったり、ワールド内のオブジェクトを利用したりと、戦術的な戦闘が楽しめる。
            日本語フルローカライズ:シリーズで初の日本語フルローカライズに対応。総勢50名近いキャスト陣 による日本語フルボイスにより、メインクエストやサブクエストは当然ながら村人の雑談や吟遊詩人の歌声まで、あますことなく日本語吹き替えを実施。ローカ ライズのボリュームは、数ある海外RPGの中でも最大級。")
Game.create(title: "ファイナルファンタジーVII リメイク", company: "スクエア・エニックス", price: 8080, genre: 3, released_at: "2020/4/10",
            story: "1997年にPlayStationで発売された『FINAL FANTASY VII』の主要スタッフが手掛ける『FINAL FANTASY VII REMAKE』。
            壮大な物語や魅力的なキャラクター、当時の最先端技術が駆使された映像で多くの人を魅了した不朽の名作が、時を経て「新たな物語」として生まれ変わります。
            コマンドバトルと直感的アクションが融合することで戦略性は高くなり、現代のグラフィック技術によって『FINAL FANTASY VII』の世界をリアルに再現、再生しております。")
Game.create(title: "ドラゴンクエストXI 過ぎ去りし時を求めて", company: "スクエア・エニックス", price: 8440, genre: 3, released_at: "2017/7/29",
            story: "シリーズの「新たなる原点」となる11番目の冒険が、今ここに始まる。
            「ドラゴンクエスト」シリーズ11番目となる本編最新作は、シリーズの原点に立ち返り「勇者」の冒険を描いた物語。PlayStation (R) 4、ニンテンドー3DSの2つのプラットフォームで展開される、「懐かしさ」と「新しさ」を兼ね備えた、シリーズの「新たなる原点」となる11番目の冒険、『ドラゴンクエストXI』が、今ここに始まる。")
Game.create(title: "Uncharted 4 Thief's End", company: "ソニー", price: 1773, genre: 4, released_at: "2018/7/26",
            story: "『アンチャーテッド』シリーズ完結編。18世紀の秘宝を求めて、ネイト最後の冒険が始まる
            これまでに“PS3”やPS Vitaでリリースされ、アクションアドベンチャーゲームの決定版として全世界で絶大的な評価と人気を獲得している『アンチャーテッド』シリーズ。
            シリーズの主人公でトレジャーハンターのネイサン・ドレイク（ネイト）は、これまでに財宝を求めて世界各地で冒険を繰り広げてきた。そんなネイトが今回、兄のサムとともに挑むのは、18世紀に存在したとされる幻の国に眠る海賊王の秘宝だ。しかも本作『アンチャーテッド 海賊王と最後の秘宝』は、なんとネイトの最後の冒険になる。")
Game.create(title: "BIOHAZARD RE3", company: "カプコン", price: 5148, genre: 4, released_at: "2020/4/3",
            story: "『バイオハザード RE:3』再誕!
            2作を収めた贅沢な1本、『バイオハザード RE:3』を遊び尽くせ!
            極限からの生還を目指すサバイバルホラー『バイオハザード3 ラスト エスケープ』のフルリメイク作品と、オンラインでの新たなバイオハザードともいうべき、非対称対戦サバイバルホラー『バイオハザード レジスタンス』とをあわせたコンピレーションタイトル。")
Game.create(title: "The Last of Us", company: "ソニー", price: 1718, genre: 4, released_at: " 2018/7/26",
            story: "PS4で体験する、美しくも残酷な世界
            全世界で600万本以上を売り上げ、国内外で数々の賞を獲得したPS3用サバイバルアクション『The Last of Us（ラスト・オブ・アス）』が、PS4に登場。
            些細なミスが命取りとなる緊張感あふれるゲームデザインや、文明崩壊後のアメリカで人々が資源を略奪しあう世界、そしてそこで展開する、ある男と少女のストーリー……。 フルHD(1080p)に対応し、PS4の持つ高い描画力によってさらに美しさと残酷さを増したグラフィックが、プレイヤーをより没入感の深いゲーム体験へと誘う。")
Game.create(title: "バトルフィールド 1", company: "エレクトロニック・アーツ", price: 2999, genre: 7, released_at: "2016/10/21",
            story: "壮大な64人対戦
            複数のフレンドと分隊を組み、最大64人のプレイヤーが同時に入り乱れるFPS史上最も壮大なマルチプレイ対戦に挑め。プレイヤーは歩兵として、あるいは戦車やオートバイ、複葉機から巨大な戦艦に至る陸・海・空の乗り物に乗り込んで戦うことができる。
            全面戦争の夜明けを体験
            人類史上最も大いなる戦いの数々を体験せよ。 アルプスの堅固な要塞から灼熱が襲うアラビアの砂漠に至るまで、陸・海・空のすべてでケタ違いのスケールで展開される戦い。プレイヤーは全面戦争という近代戦の原点、その誕生をその目で確かめることになる。
            大地が姿を変えるリアルな破壊
            現実のようにもたらされる破壊が、あらゆる戦闘を特別な一度きりの体験に変える。 大小さまざまなビークル、さらには建物丸ごとを破壊しつくせ。 小さな木造家屋から巨大な石造りの要塞、今そこに立ち戦いを繰り広げている大地までもが、一瞬で吹き飛び、引き裂かれる。
            世界を果てまで巻き込む戦場のストーリー
            アドベンチャーに満ちたキャンペーンを通して見出す大戦世界。世界が初めて体験した陸・海・空をまたにかける近代戦を軸に複数のキャラクターの視点で、さまざまな世界規模の戦いが描かれる。")
Game.create(title: "コール オブ デューティ モダン・ウォーフェア", company: "ソニー", price: 6300, genre: 7, released_at: "2019/10/25",
            story: "コール オブ デューティ モダン・ウォーフェアシリーズの完全新規の最新作! 潜入作戦に備えろ。 Modern Warfare再び!
            戦争のリスクはなくならない。Tier1オペレーターの精鋭として、全世界の勢力に影響を及ぼす緊迫した戦況に参戦せよ。 全てはここから始まった―Infinity Wardが、ゲーム史に残るModern Warfareシリーズの世界観を今一度描き直します。
            コール オブ デューティ モダン・ウォーフェアのキャンペーンモードでは、これまでのシリーズからさらに可能性を広げ、Modern Warfareにしかできない 型破りな展開のダイナミックかつ感性に訴えかけるストーリーをお届け。
            お馴染みのマルチプレイヤーでは、オンラインで究極の戦闘体験が待っています。 部隊を編成して、全てのスキルレベルに対応した数々の作戦に協力して挑むのも良いでしょう。")
Game.create(title: "Ace Conbat 7 Skies Unknown", company: "バンダイナムコ", price: 4880, genre: 6, released_at: "2018/12/31",
            story: "空の革新、雲が戦闘の駆け引きを生む")
Game.create(title: "Detroit- Become Human", company: "ソニー", price: 3400, genre: 9, released_at: "2018/11/21",
            story: "それは命か、それともモノか。
            作品紹介 あなたの感情と、選択が運命を紡ぐ、壮大なオープンシナリオ・アドベンチャー『Detroit Become Human』がお手頃価格で再登場。
            ストーリー 2038年、デトロイト。人工知能やロボット工学が高度に発展を遂げた、アンドロイド産業の都。 人間と同等の外見、知性を兼ね備え、様々な労働や作業を人間に代わって担うようになったアンドロイドは、社会にとって不可欠な存在となり、人類はかつてない豊かさを手にいれた。 しかし、その一方で、職を奪われた人々による反アンドロイド感情が高まるなど、社会には新たな軋轢と緊張が生まれはじめる。 そんな中、奇妙な個体が発見される。「変異体」と名付けられたそのアンドロイドたちは、あたかも自らの意志を持つかのように行動しはじめたのだった。
            ")
Game.create(title: "グランツーリスモSPORT", company: "ソニー", price: 1773, genre: 10, released_at: "2019/10/4",
            story: "クルマを愛するすべての人へ
            PlayStationHitsとなって、再登場。 PS4(R)のテクノロジーにより、シリーズ最高のクオリティを実現する最新作。 運転する楽しさを多くの人に伝え「モータースポーツを生まれ変わらせる」ことを目指し、FIA(国際自動車連盟)との間にパートナーシップを締結。 年一度開催のFIAセレモニーでオンラインプレイの優勝者の表彰を行う予定。FIAとともに、これからのモータースポーツの100年をデザインする。
            「グラフィック」 ~ 4K、60fps、HDR、ワイドカラープロセスを実現 「サウンド」 ~ トルクの揺らぎまで伝える実車さながらの音響体験 「クルマ」 ~ 市販車からレーシングカー、コンセプトカーまで150台以上のクルマを収録 「コース」 ~ 高速オーバルトラックから首都高速まで、17ロケーション28レイアウトを収録 「アシスト機能」 ~ どなたでも楽しめる高度なドライビングアシスト機能 「挙動シミュレーター」 ~ リアリティと乗りやすさを両立したGTシリーズ最高の自動車シミュレーション 「ブランドセントラル」 ~ クルマを手に入れる。ブランドを知る。ブランドと出会うための新しいポータル 「アーケード&オープンロビー」 ~ 手軽に、自由に、レースを楽しもう 「スポーツモード」 ~ これからのモータースポーツ、100年のデザイン。オンラインレーシングモード 「新しい写真の世界『スケープス』」 ~ 愛車と撮影旅行に出かけよう 「リバリーエディター」 ~ クルマのエクステリアを自在にアレンジ 「ソーシャル機能」 ~ クルマとドライビングから広がるフレンドとのコミュニケーション空間 「VRドライブ」 ~ ドライバーズシートに座ったリアリティを")
Game.create(title: "Need for Speed Payback", company: "エレクトロニック・アーツ", price: 4580, genre: 10, released_at: "2017/11/10",
            story: "世界屈指の人気ゲーム「ニード・フォー・スピード」が帰って来た。新しいアクションドライブ超大作「ニード・フォー・スピード ペイバック」で復讐劇を繰り広げよう。フォーチュン峡谷の裏社会を舞台に、裏切りによって仲間クルーとの分裂を経験したあなたは、街のカジノや犯罪、警察を牛耳る悪の巨大組織、ハウスを倒し復讐を遂げるために再結集を果たすことに。この腐敗したギャンブラーの楽園では、高額な配当が常にハウスの手に渡ります。 「レーサー」の異名を持つタイラー、「ショーマン」のマックと「ホイールマン」のジェスを操って、刺激的かつ多彩なイベントの数々に挑戦しましょう。")
Game.create(title: "STREET FIGHTER V", company: "カプコン", price: 3509, genre: 12, released_at: "2020/2/14",
            story: "新たなる王者(チャンピオン)、ここに誕生。
            個性豊かなキャラクター達や豊富なコンテンツとともに最高にエキサイティングなバトルを、お手頃価格で始めよう!
            オンラインで友達に挑戦したり、eスポーツの舞台で名声と栄光を競おう。")
Game.create(title: "FIFA 20", company: "", price: 5600, genre: 13, released_at: "2019/9/27",
            story: "VOLTAでリアルなストリートサッカーを再現
            EA SPORTS VOLTAでサッカーの舞台は再びストリートへ。カルチャー、クリエイティビティ、スタイル、その全てが本物。リアルなストリートサッカーがここに登場します。自分だけのキャラクターを作成し、自分だけのスタイルを表現しましょう。世界を舞台に、流れるようなサッカーを自由にプレイできます。
            かつてないリアルなプレイが可能に
            今までにないほどリアルなプレイを可能にする、徹底的に考え抜かれたフットボールインテリジェンスを体験しましょう。フットボールインテリジェンスにより、ピッチ上で繰り広げられるありとあらゆる瞬間が飛躍的に向上。オンボール、オフボール、スルーボール、全ての瞬間が進化を遂げます。3つの柱: 決定的な瞬間(オンボール)、リアルなゲームフロー(オフボール)、ボールの物理挙動(スルーボール)により、プレイヤーを中心に試合が展開していきます。
            世界で最も権威あるクラブ大会が再び登場
            UEFA Champions League、Europa League、Super Cupなど、世界で最も権威あるクラブ大会が再び「FIFA 20」で登場。公式実況、ユニフォームバッジ、試合球、象徴的なトロフィーをはじめ、FIFA 20 Ultimate Team、キャリアモード、独立型のChampions Leagueモードといった豊富なゲームモードを搭載し、本物のUEFAサッカーを体験。")
Game.create(title: "eFootball ウイニングイレブン 2020", company: "コナミ", price: 4730, genre: 13, released_at: "2019/9/12",
            story: "■新しい駆け引きが生まれる。イニエスタも心酔した、局面で使えるテクニックを実現
            ■フォトリアリズムのさらなる追求。突き詰めた映像美
            ■生まれ変わった「Master League」で自分だけの物語を
            ■新モード「Matchday」は世界のサッカーをeスポーツで体感する
            ■封入アイテム (myClub で利用できるDLコンテンツ)")
Game.create(title: "プロ野球スピリッツ2019", company: "コナミ", price: 4250, genre: 13, released_at: "2019/7/18",
            story: "リアル系プロ野球ゲームの最高峰『プロ野球スピリッツ』シリーズ最新作が4年ぶりに登場!
            プレイステーション4対応となった本作では、選手たちの表情やフォームといった外見はもちろん、思考などの特徴も再現。まさに本物そっくりのプロ野球が楽しめます。
            12球団の協力を得て、選手たちの顔を360度から撮影したデータを元に、3Dのモデルデータを作成。
            物理的に正しい光の描写を行うレンダリング手法が取り入れ、スタジアムの表現もよりリアルに!
            本作では、2018年シーズンの実績データをもとにしたAIを、個々の選手や監督に搭載!")
Game.create(title: "実況パワフルプロ野球2018", company: "コナミ", price: 4880, genre: 13, released_at: "2018/4/26",
            story: "「パワフェス」モードが舞台を豪華客船に変えて、パワーアップ!
            今度の舞台は洋上! 豪華客船で繰り広げられる野球の祭典「パワフェス」!
            試合ルールを決めるルーレットに、新たなキャラ参戦など、新要素がもりだくさん!
            パワプロシリーズ初のVR対応")
Game.create(title: "太鼓の達人 セッションでドドンがドン!", company: "バンダイナムコ", price: 5318, genre: 11, released_at: "2017/10/26",
            story: "「太鼓の達人」がついにPlayStation (R) 4に登場!
            。みんなが知っている定番ソング、最新ヒット曲を70曲以上収録! ゲームセンターでおなじみの「太鼓の達人」がおうちでも楽しめる!
            。PS4「太鼓の達人」ならではの新機能も充実! 演奏ゲームの新機能として、「フレンドセッション演奏」と「ゲストセッション演奏」を搭載。 「フレンドセッション演奏」では、友達や家族のSony Entertainment Network アカウントを フレンド登録しておくと、その場に友達・家族がいなくても、友達や家族の演奏データと気軽にセッションを楽しめる! 「ゲストセッション演奏」では、ドラえもん、初音ミク、ハローキティ、パックマン、三島平八 (鉄拳7) などの 人気キャラクターと一緒にセッション演奏を楽しめる!
            。全国のプレイヤーを相手に腕試しを楽しめる新モード「太鼓ランクマッチ」! 腕前に応じて全国のプレイヤーの 演奏データとマッチング。勝てば段位が上がるので、上位を目指して演奏バトルを楽しもう!")


# シードユーザー 5+1+9=15人
seed_users = ['一花', '二乃', '三玖', '四葉', '五月', '風太郎', 'サナ', 'ジヒョ', 'ジョンヨン', 'ダヒョン', 'チェヨン', 'ツウィ', 'ナヨン', 'ミナ', 'モモ']
n = 0
seed_users.each do |seed_user|
  n = n + 1
  user = User.new(
    name: "#{seed_user}", 
    email: "user#{n}@example.com", 
    password: "password_for_user#{n}",
    introduce: "#{seed_user}の自己紹介です。",
    admin: false,
    # icon: File.open("./app/assets/images/seed_users/#{seed_user}.jpg"),
    confirmed_at: Time.now,
  )
  user.skip_confirmation!
  user.save
end
  
# ゲストユーザー用シードデータ
guest_user = User.new(
  # id: 16,
  name: "ゲスト", 
  email: "guest@example.com", 
  password: "password_for_guest",
  introduce: "ゲストの自己紹介です。Thank you for your watching my review app!",
  admin: false,
  # icon: File.open("./app/assets/images/seed_users/ゲスト.png"),
  confirmed_at: Time.now,
)
guest_user.skip_confirmation!
guest_user.save
  
# ゲストユーザー（管理者）用シードデータ
admin_user = User.new(
  # id: 17,
  name: "アドミン", 
  email: "admin@example.com", 
  password: "password_for_admin",
  introduce: "アドミンの自己紹介です。Thank you for your watching my review app!",
  admin: true,
  # icon: File.open("./app/assets/images/seed_users/アドミン.png"),
  confirmed_at: Time.now,
)
admin_user.skip_confirmation!
admin_user.save
    
# レビュー、コメント、気になる、持ってるのシードを作成
20.times do |g|
  15.times do |u|
    u = u + 1
    Review.create(
      direction: rand(0..20),
      operability: rand(0..20),
      story: rand(0..20),
      volume: rand(0..20),
      like: rand(0..20),
      summary: "レビューの見出し",
      body: "レビュー本文レビュー本文レビュー本文レビュー本文",
      game_id: rand(1..30),
      user_id: u,
    )

    Comment.create(
      body: "コメント本文コメント本文",
      game_id: rand(1..30),
      user_id: u,
    )
      
    Favorite.create(
      game_id: rand(1..30),
      user_id: u,
    )  
        
    Own.create(
      game_id: rand(1..30),
      user_id: u,
    )
  end
end

# ゲストのレビュー等を作成
15.times do |g|
  g = g + 1
  Review.create(
    direction: 0,
    operability: 0,
    story: 0,
    volume: 0,
    like: 0,
    summary: "レビューの見出し",
    body: "レビュー本文レビュー本文レビュー本文レビュー本文",
    game_id: g,
    user_id: 16,
  )
    
  Comment.create(
    body: "コメント本文コメント本文",
    game_id: g+10,
    user_id: 16,
  )

  Favorite.create(
    game_id: g+10,
    user_id: 16,
  )  
    
  Own.create(
    game_id: g,
    user_id: 16,
  )
end

# game10~20にアドミンのレビュー等を作成
10.times do |g|
  g = g + 1
  Review.create(
    direction: 20,
    operability: 20,
    story: 20,
    volume: 20,
    like: 20,
    summary: "レビューの見出し",
    body: "レビュー本文レビュー本文レビュー本文レビュー本文",
    game_id: g+10,
    user_id: 17
  )

  Comment.create(
    body: "コメント本文コメント本文",
    game_id: g,
    user_id: 17,
  )

  Favorite.create(
    game_id: g,
    user_id: 17,
  )  

  Own.create(
    game_id: g+10,
    user_id: 17,
  )
end
